InformationRegisters/Письма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Письма</Name>
			<Comment>Почтовые сообщения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время прочтения писмьма приложением</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было отправлено письмо или адрес отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки письма</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяПочтовогоЯщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>MessageID почтового сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Письма/Ext/ManagerModule.bsl
Функция Загрузить(Сигнатура,  Дата, Регион, Инициатор, АбонентВнешний, ДатаОтправки='00010101000000', АдресОтправителя = "", АдресПолучателя="", ИмяПользователяПочтовогоЯщика="", Свойство1="") Экспорт
	
	Доступно = 		ТипЗнч(Сигнатура) = Тип("Строка")
				И 	ЗначениеЗаполнено(Сигнатура)
				И 	ТипЗнч(Дата)							= Тип("Дата")
				И 	ТипЗнч(Регион) 							= Тип("СправочникСсылка.Страны")
				И 	ТипЗнч(Инициатор) 						= Тип("Строка")
				И 	ТипЗнч(АбонентВнешний) 					= Тип("Строка")
				И 	ТипЗнч(ДатаОтправки) 					= Тип("Дата")
				И 	ТипЗнч(АдресОтправителя) 				= Тип("Строка")
				И 	ТипЗнч(АдресПолучателя) 				= Тип("Строка")
	 			И 	ТипЗнч(ИмяПользователяПочтовогоЯщика)	= Тип("Строка")	
				И 	ТипЗнч(Свойство1) 						= Тип("Строка");

	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ = РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = Сигнатура;
	НЗ.Прочитать();
	
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ.Сигнатура 						= Сигнатура;
	НЗ.Дата 							= Дата;
	НЗ.Регион 							= Регион;
	НЗ.Инициатор 						= Инициатор;
	НЗ.АбонентВнешний 					= Конвертация.ТелефонВнешнийНормализовать(АбонентВнешний);
	НЗ.ДатаОтправки  					= ДатаОтправки;
	НЗ.АдресОтправителя 				= АдресОтправителя;
	НЗ.АдресПолучателя					= АдресПолучателя;
	НЗ.ИмяПользователяПочтовогоЯщика 	= ИмяПользователяПочтовогоЯщика;
	НЗ.Свойство1						= Свойство1;
	
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка записи",УровеньЖурналаРегистрации.Ошибка, ,СтрШаблон("Сигнатура = %1, Дата = %2, Регион = %3, Инициатор = %4, АбонентВнешний = %5", Сигнатура, Дата, Регион, Инициатор, АбонентВнешний), ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
 	
КонецФункции

Функция ПолучиДатуОтправления(MessageID) Экспорт
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = "";
	
	Достуно =  ТипЗнч(MessageID) = Тип("Строка");
	Доступно = Доступно И СтрДлина(MessageID)>0;
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ = РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = MessageID;
	НЗ.Прочитать();
	
	Если НЕ НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	Возврат НЗ.ДатаОтправки
КонецФункции

Функция УстановиЗначениеРеквизита(Сигнатура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	Доступно = Доступно И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено");
	Доступно = Доступно И ЗначениеЗаполнено(ЗначениеРеквизита);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Письма.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Сигнатура	=	Сигнатура;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.Письма.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;

	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;

	Попытка
			НЗ.Записать();
			Возврат Истина;
	Исключение
			ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.Письма, , ОписаниеОшибки());
			Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
		
КонецФункции
